index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><b>Timothy Budd's Kamin Interpreters in C++</b></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="<b>Timothy Budd's Kamin Interpreters in C++</b>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-25T21:19+0000"/>
<meta name="author" content="nil"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><b>Timothy Budd's Kamin Interpreters in C++</b></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Original Sources</a></li>
<li><a href="#sec-2">2 Documentation</a></li>
<li><a href="#sec-3">3 Build and Test</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Original Sources</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/kamin/budd/">http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/lisp/impl/kamin/budd/</a>
</li>
</ul>

<p>  I have played with Timothy Budd's C++ versions of the Kamin interpreters on
  and off for many years and find them interesting and educational.  However
  they have been languishing in the unexplored depths of the Internet for too
  long and it is time they were resurrected and updated for another generation
  of programming linguists to learn from.
</p>
<p>
  The code is reformatted and updated to compile without warning or error with
  the latest standard C++ compilers and added tests derived from the examples
  supplied by Kamin for his original Pascal interpreters.  Also tags have been
  added to code sections so they may be automatically included in the
  documentation without manually copying the relevant sections into the LaTeX
  source files.  I couple of bugs have been found and corrected but more major
  work on testing and debugging the RAII memory management is required which is
  the next major job.
</p>
<p>
  Currently the code formatting in the HTML version of the documentation is not
  great and a bit more tweaking of the tex4ht config file is needed.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Documentation</h2>
<div class="outline-text-2" id="text-2">

<p>  Here are links to the updated documentation.  The text is pretty much as it
  was in the original files released by Timothy Budd but the code snippets are
  obtained automatically from the updated C++ source files.
</p><ul>
<li><a href="Doc/html/BuddKaminInterpreters.html">HTML</a>
</li>
<li><a href="Doc/BuddKaminInterpreters.pdf">pdf</a>
</li>
<li><a href="TODO.html">TODO</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Build and Test</h2>
<div class="outline-text-2" id="text-3">

<p>  The default build setup is to compile with <code>g++</code> but <code>the interpreters</code> have
  also been tested with <code>clang++</code> and any other standard C++ compiler should be
  suitable.  The particular compiler can be configured by editing
  <code>Make/Makefile.config</code>.
</p><ul>
<li>To build all 8 interpreters: <code>make</code>
</li>
<li>To run all the tests: <code>make test</code>
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-25T21:19+0000</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
